tap "gcenx/wine"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "instrumenta/instrumenta" #for kubeval
tap "kwilczynski/pkenv"
tap "romkatv/powerlevel10k"
#Linux tooling
brew "python@3.11"
brew "bash"
brew "binutils"
brew "bison"
brew "boost"
brew "qemu"
brew "lima"
brew "colima" #docker desktop replacement
brew "coreutils"
brew "diffutils"
brew "docker"
brew "docker-compose"
brew "ed"
brew "file-formula"
brew "findutils"
brew "flex"
brew "fzf"
brew "gawk"
brew "git"
brew "git-annex"
brew "git-crypt"
brew "git-remote-gcrypt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gpatch"
brew "grep"
brew "gzip"
brew "htop"
brew "imagemagick"
brew "jq"
brew "less"
brew "libressl"
brew "make"
brew "nano"
brew "openssh"
brew "pass"
brew "perl"
brew "pipenv"
brew "pwgen"
brew "pyenv"
brew "rsync"
brew "screen"
brew "unzip"
brew "nvim"
brew "watch"
brew "wdiff"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-completions"
brew "romkatv/powerlevel10k/powerlevel10k"
#Devops tooling
brew "helm"
brew "kubernetes-cli"
brew "kubeval"
brew "kustomize"
brew "python@3.10"
brew "lefthook"
brew "prometheus"
brew "shellcheck"
brew "terraform-docs"
brew "terragrunt"
brew "tfenv"
brew "tmux"
brew "go-task/tap/go-task"
brew "kwilczynski/pkenv/pkenv"
#Other tools
cask "alacritty" #better terminal
cask "breaktimer" 
cask "font-hack-nerd-font"
cask "font-inconsolata"
cask "opera"
cask "rectangle"
cask "sublime-text"
#game
brew "katago"
#Windows tools
brew "winetricks"
cask "wine-crossover"
cask "utm"
